; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city)
        (dummy-goal)
        (dummy-fact)
)
(:functions (cost))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc) (dummy-fact)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc) (dummy-fact)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc) (dummy-fact)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc) (dummy-fact)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from) (dummy-fact)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to) (dummy-fact)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))

(:action pref-op0
  :precondition (and (dummy-fact))
  :effect (and (not (dummy-fact)) (dummy-goal)))

(:action pref-op1
:precondition (and (dummy-fact)
(airplane a0) 
(airplane a1) 
(airport l00) 
(airport l10) 
(airport l20) 
(airport l30) 
(airport l40) 
(at a0 l40)
(at a1 l20)
(at p0 l40)
(at p1 l10)
(at p2 l40)
(at p3 l20)
(at p4 l21)
(at t0 l01)
(at t1 l10)
(at t2 l21)
(at t3 l30)
(at t4 l41)
(city c0) 
(city c1) 
(city c2) 
(city c3) 
(city c4) 
(in-city l00 c0) 
(in-city l01 c0) 
(in-city l10 c1) 
(in-city l11 c1) 
(in-city l20 c2) 
(in-city l21 c2) 
(in-city l30 c3) 
(in-city l31 c3) 
(in-city l40 c4) 
(in-city l41 c4) 
(location l00) 
(location l01) 
(location l10) 
(location l11) 
(location l20) 
(location l21) 
(location l30) 
(location l31) 
(location l40) 
(location l41) 
(obj p0) 
(obj p1) 
(obj p2) 
(obj p3) 
(obj p4) 
(truck t0) 
(truck t1) 
(truck t2) 
(truck t3) 
(truck t4) 
)
:effect (and (not (dummy-fact)) (dummy-goal) (increase (cost) 100)))

)

; problem
(define (problem logistics-c5-s2-p5-a2)
(:domain logistics-strips)
(:objects a0 a1 
          c0 c1 c2 c3 c4 
          t0 t1 t2 t3 t4 
          l00 l01 l10 l11 l20 l21 l30 l31 l40 l41 
          p0 p1 p2 p3 p4 
)
(:INIT (= (cost) 0)
	(dummy-fact)
(airplane a0) 
(airplane a1) 
(airport l00) 
(airport l10) 
(airport l20) 
(airport l30) 
(airport l40) 
(at a0 l00)
(at a1 l20)
(at p0 l10)
(at p1 l20)
(at p2 l00)
(at p3 l41)
(at p4 l31)
(at t0 l00)
(at t1 l10)
(at t2 l20)
(at t3 l31)
(at t4 l41)
(city c0) 
(city c1) 
(city c2) 
(city c3) 
(city c4) 
(in-city l00 c0) 
(in-city l01 c0) 
(in-city l10 c1) 
(in-city l11 c1) 
(in-city l20 c2) 
(in-city l21 c2) 
(in-city l30 c3) 
(in-city l31 c3) 
(in-city l40 c4) 
(in-city l41 c4) 
(location l00) 
(location l01) 
(location l10) 
(location l11) 
(location l20) 
(location l21) 
(location l30) 
(location l31) 
(location l40) 
(location l41) 
(obj p0) 
(obj p1) 
(obj p2) 
(obj p3) 
(obj p4) 
(truck t0) 
(truck t1) 
(truck t2) 
(truck t3) 
(truck t4) 
)
(:goal (and
(dummy-goal)
(at p2 l40)
))
(:metric maximize (cost))
)

; plan
1. (load-airplane p2 a0 l00)
   deleted: (at p2 l00)
   added: (in p2 a0)
   goals met: 0 of 2
2. (fly-airplane a1 l20 l30)
   deleted: (at a1 l20)
   added: (at a1 l30)
   goals met: 0 of 2
3. (load-truck p4 t3 l31)
   deleted: (at p4 l31)
   added: (in p4 t3)
   goals met: 0 of 2
4. (drive-truck t0 l00 l01 c0)
   deleted: (at t0 l00)
   added: (at t0 l01)
   goals met: 0 of 2
5. (load-truck p3 t4 l41)
   deleted: (at p3 l41)
   added: (in p3 t4)
   goals met: 0 of 2
6. (fly-airplane a0 l00 l40)
   deleted: (at a0 l00)
   added: (at a0 l40)
   goals met: 0 of 2
7. (drive-truck t3 l31 l30 c3)
   deleted: (at t3 l31)
   added: (at t3 l30)
   goals met: 0 of 2
8. (drive-truck t4 l41 l40 c4)
   deleted: (at t4 l41)
   added: (at t4 l40)
   goals met: 0 of 2
9. (unload-airplane p2 a0 l40)
   deleted: (in p2 a0)
   added: (at p2 l40)
   goals met: 1 of 2
10. (unload-truck p4 t3 l30)
   deleted: (in p4 t3)
   added: (at p4 l30)
   goals met: 1 of 2
11. (unload-truck p3 t4 l40)
   deleted: (in p3 t4)
   added: (at p3 l40)
   goals met: 1 of 2
12. (load-airplane p4 a1 l30)
   deleted: (at p4 l30)
   added: (in p4 a1)
   goals met: 1 of 2
13. (drive-truck t4 l40 l41 c4)
   deleted: (at t4 l40)
   added: (at t4 l41)
   goals met: 1 of 2
14. (fly-airplane a1 l30 l20)
   deleted: (at a1 l30)
   added: (at a1 l20)
   goals met: 1 of 2
15. (unload-airplane p4 a1 l20)
   deleted: (in p4 a1)
   added: (at p4 l20)
   goals met: 1 of 2
16. (load-airplane p1 a1 l20)
   deleted: (at p1 l20)
   added: (in p1 a1)
   goals met: 1 of 2
17. (load-truck p4 t2 l20)
   deleted: (at p4 l20)
   added: (in p4 t2)
   goals met: 1 of 2
18. (fly-airplane a1 l20 l10)
   deleted: (at a1 l20)
   added: (at a1 l10)
   goals met: 1 of 2
19. (drive-truck t2 l20 l21 c2)
   deleted: (at t2 l20)
   added: (at t2 l21)
   goals met: 1 of 2
20. (unload-airplane p1 a1 l10)
   deleted: (in p1 a1)
   added: (at p1 l10)
   goals met: 1 of 2
21. (load-airplane p0 a1 l10)
   deleted: (at p0 l10)
   added: (in p0 a1)
   goals met: 1 of 2
22. (unload-truck p4 t2 l21)
   deleted: (in p4 t2)
   added: (at p4 l21)
   goals met: 1 of 2
23. (fly-airplane a1 l10 l40)
   deleted: (at a1 l10)
   added: (at a1 l40)
   goals met: 1 of 2
24. (unload-airplane p0 a1 l40)
   deleted: (in p0 a1)
   added: (at p0 l40)
   goals met: 1 of 2
25. (load-airplane p3 a1 l40)
   deleted: (at p3 l40)
   added: (in p3 a1)
   goals met: 1 of 2
26. (fly-airplane a1 l40 l20)
   deleted: (at a1 l40)
   added: (at a1 l20)
   goals met: 1 of 2
27. (unload-airplane p3 a1 l20)
   deleted: (in p3 a1)
   added: (at p3 l20)
   goals met: 1 of 2
28. (pref-op1)
   deleted: (dummy-fact)
   added: (dummy-goal)
   changed: (cost) from 0 to 100
   goals met: 2 of 2
